# SpotElevationMissesReference Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..SpotElevationMissesReference Property
BuiltInFailures..::..DimensionFailures Class See Also
---
Spot Dimension does not lie on its reference.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SpotElevationMissesReference { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpotElevationMissesReference As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SpotElevationMissesReference {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace